Se comienza con la importacion de las librerias necesarias para realizar el EDA (Analisis Exploratorio de Datos) y ETL (Extraccion, Transformacion y Carga) de los datos. -

In [50]:
import pandas as pd
import numpy as np

Se realiza la igenta de archivos, de los cuales hay que trabajar. -

In [51]:
#C:\Users\andres\AppData\Local\Programs\Python\Python310\MLOpsReviews\Datasets
ratings_1_df = pd.read_csv("C:\\Users\\andres\\AppData\\Local\\Programs\\Python\\Python310\\MLOpsReviews\\Datasets\\1.csv") 
ratings_2_df = pd.read_csv("C:\\Users\\andres\\AppData\\Local\\Programs\\Python\\Python310\\MLOpsReviews\\Datasets\\2.csv")
ratings_3_df = pd.read_csv("C:\\Users\\andres\\AppData\\Local\\Programs\\Python\\Python310\\MLOpsReviews\\Datasets\\3.csv")
ratings_4_df = pd.read_csv("C:\\Users\\andres\\AppData\\Local\\Programs\\Python\\Python310\\MLOpsReviews\\Datasets\\4.csv")
ratings_5_df = pd.read_csv("C:\\Users\\andres\\AppData\\Local\\Programs\\Python\\Python310\\MLOpsReviews\\Datasets\\5.csv")
ratings_6_df = pd.read_csv("C:\\Users\\andres\\AppData\\Local\\Programs\\Python\\Python310\\MLOpsReviews\\Datasets\\6.csv")
ratings_7_df = pd.read_csv("C:\\Users\\andres\\AppData\\Local\\Programs\\Python\\Python310\\MLOpsReviews\\Datasets\\7.csv")
ratings_8_df = pd.read_csv("C:\\Users\\andres\\AppData\\Local\\Programs\\Python\\Python310\\MLOpsReviews\\Datasets\\8.csv")

In [52]:
df = pd.read_csv("C:\\Users\\andres\\AppData\\Local\\Programs\\Python\\Python310\\MLOpsReviews\\Proyecto_Individual_EDA_ETL.csv")

Realizamos una visualizacion superficial de los Dataframes para dar vista a que se hayan cargado corectamente, a su vez observa las columnas, filas y el tipo de dato que contienen para trabajar, por ultimo controlar sobre los cambios que vamos a realizar. -

In [53]:
ratings_1_df.head()

   userId  rating   timestamp movieId
0       1     1.0  1425941529   as680
1       1     4.5  1425942435  ns2186
2       1     5.0  1425941523  hs2381
3       1     5.0  1425941546  ns3663
4       1     5.0  1425941556  as9500

In [54]:
ratings_2_df.head()

   userId  rating   timestamp movieId
0   15424     3.0  1369585147  ns3012
1   15424     2.5  1369586851  ns3195
2   15424     3.0  1369585112   ns357
3   15424     2.5  1372541498  as7069
4   15424     3.0  1369586846  as6943

In [55]:
ratings_3_df.head()

   userId  rating  timestamp movieId
0   31332     4.0  974205261  as2251
1   31332     3.0  974205170  as7226
2   31332     3.0  974205034  as6479
3   31332     3.0  974205261  ns2422
4   31332     4.0  974205034  as4041

In [56]:
ratings_4_df.head()

   userId  rating   timestamp movieId
0   46200     5.0  1015603683  as3203
1   46200     1.0  1012323069  as5959
2   46200     3.0   996245609  as4430
3   46200     4.0   996245595  as6604
4   46200     3.0   996245595   ds311

In [57]:
ratings_5_df.head()

   userId  rating   timestamp movieId
0   61768     4.0  1438075492  as5376
1   61768     3.0  1435693148  as7172
2   61768     3.0  1438075482  ns4557
3   61768     3.0  1438075496  ns7804
4   61768     3.5  1438075486  as3030

In [58]:
ratings_6_df.head()

   userId  rating   timestamp movieId
0  249182     3.5  1460518555   ds327
1  249182     4.0  1461878500  ns2124
2  249182     3.0  1460182087  as8841
3  249182     4.5  1460183214  hs2318
4  249182     2.5  1460184332  as5743

In [59]:
ratings_7_df.head()

   userId  rating  timestamp movieId
0  265409     5.0  891417042   ds781
1  265409     5.0  891417042  as9331
2  265409     4.0  891417435   hs384
3  265409     3.0  891417191   hs398
4  265409     5.0  891417224  as8434

In [60]:
ratings_8_df.head()

   userId  rating   timestamp movieId
0  108422     4.5  1350689762  as1399
1  108422     4.0  1350341401  as6724
2  108422     5.0  1350689691   ns512
3  108422     4.5  1350341088  ns7444
4  108422     4.5  1350689619  as2230

Se utliza la funcion df.info() de la biblioteca Pandas para imprimir información detallada sobre el Dataframe a consultar. -

In [61]:
ratings_1_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB

In [62]:
ratings_2_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB

In [63]:
ratings_3_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB

In [64]:
ratings_3_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB

In [65]:
ratings_4_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB

In [66]:
ratings_5_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB

In [67]:
ratings_6_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB

In [68]:
ratings_7_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 524289 entries, 0 to 524288
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     524289 non-null  int64
 1   rating     524289 non-null  float64
 2   timestamp  524289 non-null  int64
 3   movieId    524289 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 16.0+ MB

In [69]:
ratings_8_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB

Al ver que los datos no son correlativos en los Dataframe, ya que contienen datos nulos, realizo la contabilidad de los mismos combinando la función df.isna() con la función df.sum() de Pandas, para contar el número total de valores nulos en cada columna del df.

In [70]:
ratings_1_df.isna().sum()

userId       0
rating       0
timestamp    0
movieId      0
dtype: int64

In [71]:
ratings_2_df.isna().sum()

userId       0
rating       0
timestamp    0
movieId      0
dtype: int64

In [72]:
ratings_3_df.isna().sum()

userId       0
rating       0
timestamp    0
movieId      0
dtype: int64

In [73]:
ratings_4_df.isna().sum()

userId       0
rating       0
timestamp    0
movieId      0
dtype: int64

In [74]:
ratings_5_df.isna().sum()

userId       0
rating       0
timestamp    0
movieId      0
dtype: int64

In [75]:
ratings_6_df.isna().sum()

userId       0
rating       0
timestamp    0
movieId      0
dtype: int64

In [76]:
ratings_7_df.isna().sum()

userId       0
rating       0
timestamp    0
movieId      0
dtype: int64

In [77]:
ratings_8_df.isna().sum()

userId       0
rating       0
timestamp    0
movieId      0
dtype: int64

A continuacion, realizamos la consulta sobre si se encuentran valores duplicados en los Dataframe, a traves de la funcion df.duplicated() y acompañado con la funcion df.sum(), para sumar si efecvtivamente se encuentran dichos valores nulos. -

In [78]:
ratings_1_df.duplicated().sum()

14

In [79]:
ratings_2_df.duplicated().sum()

10

In [80]:
ratings_3_df.duplicated().sum()

23

In [81]:
ratings_4_df.duplicated().sum()

18

In [82]:
ratings_5_df.duplicated().sum()

8

In [83]:
ratings_6_df.duplicated().sum()

22

In [84]:
ratings_7_df.duplicated().sum()

9

In [85]:
ratings_8_df.duplicated().sum()

20

A continuacion procedemos a concatenar todos los Dataframe para mejor labor. -

In [86]:

ratings_df = pd.concat([ratings_1_df, ratings_2_df, ratings_3_df, ratings_4_df, ratings_5_df, ratings_6_df, ratings_7_df, ratings_8_df])

Procedemos a calcular el promedio de rating por movieID

In [87]:
ratings_df = ratings_df.groupby('movieId')['rating'].mean().reset_index()
ratings_df['rating'] = ratings_df['rating'].apply(lambda x: round(x, 1))

In [88]:
ratings_df = ratings_df.drop_duplicates(subset='movieId')

In [97]:
df = df.drop(columns=['show_id'])
df = df.drop(columns=['Unnamed: 0'])

In [98]:
ratings_df = ratings_df.rename(columns={'movieId': 'id'})

In [99]:
streaming_ratings_df = pd.merge(df, ratings_df, on='id')

In [100]:
streaming_ratings_df = streaming_ratings_df.rename(columns={'rating_x': 'rating'})
streaming_ratings_df = streaming_ratings_df.rename(columns={'rating_y': 'scored'})
streaming_ratings_df = streaming_ratings_df.rename(columns={'release_year': 'year'})

Finalmente creamos un nuevo CSV con todos los cambios realizados hasta el momento y lo guardamos en la carpeta "MLOpsReview". -

In [101]:
streaming_ratings_df.to_csv("streaming_ratings.csv", index=False)

In [102]:
# Se consulta si efectivamente se realizaron los cambios en el nuevo CSV
streaming_ratings_df.head()

,id,type,title,director,cast,country,date_added,year,rating,listed_in,description,duration_int,duration_type,platform,scored
0,as1,movie,the grand seduction,don mckellar,"brendan gleeson, taylor kitsch, gordon pinsent",canada,2021-03-30,2014,g,"comedy, drama",a small fishing village must procure a local d...,113.0,min,amazon,3.5
1,as2,movie,take care good night,girish joshi,"mahesh manjrekar, abhay mahajan, sachin khedekar",india,2021-03-30,2018,13+,"drama, international",a metro family decides to fight a cyber crimin...,110.0,min,amazon,3.5
2,as3,movie,secrets of deception,josh webber,"tom sizemore, lorenzo lamas, robert lasardo, r...",united states,2021-03-30,2017,g,"action, drama, suspense",after a man discovers his wife is cheating on ...,74.0,min,amazon,3.5
3,as4,movie,pink: staying true,sonia anderson,"interviews with: pink, adele, beyoncé, britney...",united states,2021-03-30,2014,g,documentary,"pink breaks the mold once again, bringing her ...",69.0,min,amazon,3.5
4,as5,movie,monster maker,giles foster,"harry dean stanton, kieran o'brien, george cos...",united kingdom,2021-03-30,1989,g,"drama, fantasy",teenage matt banting wants to work with a famo...,45.0,min,amazon,3.5

Se utliza la funcion df.info() de la biblioteca Pandas para imprimir información detallada sobre el Dataframe a consultar. -

In [95]:
streaming_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22998 entries, 0 to 22997
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     22998 non-null  int64
 1   id             22998 non-null  object
 2   show_id        22998 non-null  object
 3   type           22998 non-null  object
 4   title          22998 non-null  object
 5   director       14739 non-null  object
 6   cast           17677 non-null  object
 7   country        11499 non-null  object
 8   date_added     13444 non-null  object
 9   year           22998 non-null  int64
 10  rating         22998 non-null  object
 11  listed_in      22998 non-null  object
 12  description    22994 non-null  object
 13  duration_int   22516 non-null  float64
 14  duration_type  22516 non-null  object
 15  platform       22998 non-null  object
 16  scored         22998 non-null  float64
dtypes: float64(2), int64(2), object(13)
memory usage: 3.2+ MB

Al ver que los datos no son correlativos en los Dataframe, ya que contienen datos nulos, realizo la contabilidad de los mismos combinando la función df.isna() con la función df.sum() de Pandas, para contar el número total de valores nulos en cada columna del df. -

In [96]:
streaming_ratings_df.isna().sum()

Unnamed: 0           0
id                   0
show_id              0
type                 0
title                0
director          8259
cast              5321
country          11499
date_added        9554
year                 0
rating               0
listed_in            0
description          4
duration_int       482
duration_type      482
platform             0
scored               0
dtype: int64